Core/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.СлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтгрузки</name>
    <type>
      <types>EnumRef.СпособыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходнаяНакладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/СпособыОтгрузки/СпособыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОтгрузки</name>
  <enumValues>
    <name>ПередатьКурьеруСлужбыДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПередатьКурьеруЕдиногоСклада</name>
  </enumValues>
  <enumValues>
    <name>СамостоятельноПривезтиНаЕдиныйСклад</name>
  </enumValues>
  <enumValues>
    <name>СамостоятельноПривезтиНаСкладСлужбыДоставки</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СлужбыДоставки/СлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СлужбыДоставки</name>
  <predefined>
    <items>
      <name>ДоставкаСобственнымиСилами</name>
      <description>Доставка собственными силами</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормулаСтоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаСебестоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУчета</name>
    <type>
      <types>EnumRef.ВариантыУчетаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЯндекса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРасчетов</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетовДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыДоставки</name>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыОтгрузки</name>
    <attributes>
      <name>СпособОтгрузки</name>
      <type>
        <types>EnumRef.СпособыОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяНеРезидентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглиское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРуское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpБанковскиеРеквизиты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаказовПокупателей</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДоставлен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОтгружен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОжидаетОтгрузки</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/МаршрутныйЛист/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(СлужбаДоставки) И НЕ ЗначениеЗаполнено(Курьер)  Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоДоставкаСобственнымиСилами() Тогда
		ИсключитьРеквизитИзПроверки("СпособОтгрузки", ПроверяемыеРеквизиты);
		ИсключитьРеквизитИзПроверки("Склад", ПроверяемыеРеквизиты);
		ИсключитьРеквизитИзПроверки("АдресОтправки", ПроверяемыеРеквизиты);
	ИначеЕсли ЭтоЗаборКурьеромСлужбыДоставки() Тогда 
		ИсключитьРеквизитИзПроверки("Курьер", ПроверяемыеРеквизиты);
	ИначеЕсли ЭтоСамопривозНаСкладСлужбыДоставки() Тогда 
		ИсключитьРеквизитИзПроверки("Склад", ПроверяемыеРеквизиты);
		ИсключитьРеквизитИзПроверки("АдресОтправки", ПроверяемыеРеквизиты);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Заказы.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ka='Укажите отгружаемые заказы';ru='Укажите отгружаемые заказы'"),
		Ссылка,
		"Заказы",,
		Отказ);
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновитьДанныеЗаказов(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбновитьДанныеЗаказов(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МаршрутныйЛистЗаказы.Заказ КАК Заказ
		|ИЗ
		|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|ГДЕ
		|	МаршрутныйЛистЗаказы.Ссылка = &Ссылка";
		МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	Иначе
		МассивЗаказов = Новый Массив;
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("ЗаказыДоИзменения", МассивЗаказов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("ЗаказыДоИзменения") Тогда
		ЗаказыДоИзменения = ДополнительныеСвойства.ЗаказыДоИзменения;
		Если НЕ ТипЗнч(ЗаказыДоИзменения)=Тип("Массив") Тогда
			ЗаказыДоИзменения = Новый Массив;
		КонецЕсли; 
	Иначе
		ЗаказыДоИзменения = Новый Массив;
	КонецЕсли;
	
	ОбсужденияЗаказов = Новый Соответствие;
	Для каждого СтрокаТабличнойЧасти Из Заказы Цикл
		Если ЗаказыДоИзменения.Найти(СтрокаТабличнойЧасти.Заказ)=Неопределено Тогда
			Сообщение = "";
			Префикс = НСтр("ru='Использован в: ';ka='გამოყენებულია:'")+ОбсужденияСервер.HTMLСсылка(Ссылка);
			ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(Сообщение, Префикс);
			ОбсужденияЗаказов.Вставить(СтрокаТабличнойЧасти.Заказ, Сообщение);
		КонецЕсли; 
	КонецЦикла;
	ДополнительныеСвойства.Вставить("ОбсужденияЗаказов", ОбсужденияЗаказов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоДоставкаСобственнымиСилами()
	
	Возврат СлужбаДоставки = Справочники.СлужбыДоставки.ДоставкаСобственнымиСилами;
	
КонецФункции

Функция ЭтоЗаборКурьеромСлужбыДоставки()
	
	Возврат СпособОтгрузки = Перечисления.СпособыОтгрузки.ПередатьКурьеруЕдиногоСклада
	Или СпособОтгрузки = Перечисления.СпособыОтгрузки.ПередатьКурьеруСлужбыДоставки;
	
КонецФункции

Функция ЭтоСамопривозНаСкладСлужбыДоставки()
	
	Возврат СпособОтгрузки = Перечисления.СпособыОтгрузки.СамостоятельноПривезтиНаЕдиныйСклад
	Или СпособОтгрузки = Перечисления.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки;
	
КонецФункции

Процедура ОбновитьДанныеЗаказов(Отказ, Проведение = Истина)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОбсужденияЗаказов = Неопределено;
	ДополнительныеСвойства.Свойство("ОбсужденияЗаказов", ОбсужденияЗаказов);
	Если ТипЗнч(ОбсужденияЗаказов)<>Тип("Соответствие") Тогда
		ОбсужденияЗаказов = Новый Соответствие;
	КонецЕсли; 
	
	НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗаказов", Заказы.Выгрузить(, "Заказ"));
	Запрос.УстановитьПараметр("СлужбаДоставки", СлужбаДоставки);
	Запрос.УстановитьПараметр("Курьер", Курьер);
	Запрос.УстановитьПараметр("Проведен", Проведение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаЗаказов.Заказ КАК Документ.ЗаказПокупателя) КАК Заказ
	|ПОМЕСТИТЬ ТаблицаЗаказов
	|ИЗ
	|	&ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА &Проведен
	|			ТОГДА ТаблицаЗаказов.Заказ.ВидЗаказа.СостояниеОтгружен
	|		КОГДА НЕ &Проведен
	|			ТОГДА ТаблицаЗаказов.Заказ.ВидЗаказа.СостояниеОжидаетОтгрузки
	|	КОНЕЦ КАК НовоеСостояние,
	|	ВЫБОР
	|		КОГДА &Проведен
	|					И ТаблицаЗаказов.Заказ.СостояниеЗаказа = ТаблицаЗаказов.Заказ.ВидЗаказа.СостояниеОжидаетОтгрузки
	|				ИЛИ НЕ &Проведен
	|					И ТаблицаЗаказов.Заказ.СостояниеЗаказа = ТаблицаЗаказов.Заказ.ВидЗаказа.СостояниеОтгружен
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбновитьСостояние,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Заказ.СлужбаДоставки <> &СлужбаДоставки
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбновитьСлужбуДоставки,
	|	ВЫБОР
	|		КОГДА ТаблицаЗаказов.Заказ.Курьер <> &Курьер
	|				И &Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбновитьКурьера
	|ПОМЕСТИТЬ Действия
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.Заказ,
	|	МаршрутныйЛистЗаказы.Ссылка КАК МаршрутныйЛист
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	|		ПО ТаблицаЗаказов.Заказ = МаршрутныйЛистЗаказы.Заказ
	|			И (МаршрутныйЛистЗаказы.Ссылка <> &Ссылка)
	|			И (МаршрутныйЛистЗаказы.Ссылка.Проведен)
	|ГДЕ
	|	НЕ МаршрутныйЛистЗаказы.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Действия.Заказ,
	|	Действия.НовоеСостояние,
	|	Действия.ОбновитьСостояние,
	|	Действия.ОбновитьСлужбуДоставки,
	|	Действия.ОбновитьКурьера
	|ИЗ
	|	Действия КАК Действия
	|ГДЕ
	|	(Действия.ОбновитьСлужбуДоставки
	|			ИЛИ Действия.ОбновитьКурьера
	|			ИЛИ Действия.ОбновитьСостояние)";
	Результат = Запрос.ВыполнитьПакет();
	Ошибки = Результат[2].Выбрать();
	Если НЕ Ошибки.Количество()=0 Тогда
		Пока Ошибки.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ka='%1 уже отгружен документом %2';ru='%1 уже отгружен документом %2'"), Ошибки.Заказ, Ошибки.МаршрутныйЛист),
			Ошибки.МаршрутныйЛист,
			"Заказы", ,
			Отказ);
		КонецЦикла; 
		Возврат;
	КонецЕсли; 
	Выборка = Результат[3].Выбрать();
	ВыведенныеВидыЗаказов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
		Сообщение = ОбсужденияЗаказов.Получить(Выборка.Заказ);
		// Состояние заказа
		Если Выборка.ОбновитьСостояние Тогда
			Если НЕ ЗначениеЗаполнено(Выборка.НовоеСостояние) Тогда
				// Не настроены состояния заказов
				Если НесколькоВидовЗаказов Тогда
					Если ВыведенныеВидыЗаказов.Найти(ЗаказОбъект.ВидЗаказа)=Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон(НСтр("ka='Не задано состояние %1 заказа для вида %2';ru='Не задано состояние %1 заказа для вида %2'"),
						?(Проведение, НСтр("ka='отгрузки';ru='отгрузки'"), НСтр("ka='ожидания отгрузки';ru='ожидания отгрузки'")),
						ЗаказОбъект.ВидЗаказа),
						ЗаказОбъект.ВидЗаказа,
						?(Проведение, "СостояниеОтгружен", "СостояниеОжидаетОтгрузки"),,
						Отказ);
						ВыведенныеВидыЗаказов.Добавить(ЗаказОбъект.ВидЗаказа);
					КонецЕсли; 
				Иначе
					Если ВыведенныеВидыЗаказов.Найти(Справочники.ВидыЗаказовПокупателей.Основной)=Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон(НСтр("ka='Не задано состояние %1 заказа';ru='Не задано состояние %1 заказа'"),
						?(Проведение, НСтр("ka='отгрузки';ru='отгрузки'"), НСтр("ka='ожидания отгрузки';ru='ожидания отгрузки'"))),
						Справочники.ВидыЗаказовПокупателей.Основной,
						?(Проведение, "СостояниеОтгружен", "СостояниеОжидаетОтгрузки"),,
						Отказ);
						ВыведенныеВидыЗаказов.Добавить(Справочники.ВидыЗаказовПокупателей.Основной);
					КонецЕсли; 
				КонецЕсли; 
			Иначе
				Префикс = НСтр("ru='Состояние: ';ka='Состояние: '");
				ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(Сообщение, Префикс, ЗаказОбъект.СостояниеЗаказа, Выборка.НовоеСостояние);
				ЗаказОбъект.СостояниеЗаказа = Выборка.НовоеСостояние;
			КонецЕсли;
		КонецЕсли;
		// Служба доставки
		Если Выборка.ОбновитьСлужбуДоставки Тогда
			Префикс = НСтр("ru='Служба доставки: ';ka='Служба доставки: '");
			ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(Сообщение, Префикс, ЗаказОбъект.СлужбаДоставки, СлужбаДоставки);
			ЗаказОбъект.СлужбаДоставки = СлужбаДоставки;
		КонецЕсли;
		// Курьер
		Если Выборка.ОбновитьКурьера Тогда
			Префикс = НСтр("ru='Курьер: ';ka='Курьер: '");
			ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(Сообщение, Префикс, ЗаказОбъект.Курьер, Курьер);
			ЗаказОбъект.Курьер = Курьер;
		КонецЕсли;
		Если ЗначениеЗаполнено(Сообщение) Тогда
			ОбсужденияСервер.ДобавитьСообщение(
			Сообщение, 
			Выборка.Заказ,
			, 
			Истина);
			ЗаказОбъект.ДополнительныеСвойства.Вставить("ОбсуждениеЗаписано", Истина);
		КонецЕсли; 
		Попытка
			ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
		    Отказ = Истина;
		КонецПопытки; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура ИсключитьРеквизитИзПроверки(ИмяРеквизита, ПроверяемыеРеквизиты)
	
	Индекс = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
	Если Индекс<>Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс)
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
